// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

// Console.Write ("Введите значение min: ");
// int m = Convert.ToInt32(Console.ReadLine());

// Console.Write ("Введите значение max: ");
// int n = Convert.ToInt32(Console.ReadLine());

// int Sum(int m, int n)
// {
//     if (m == n)
//         return m;
//     else
//         return m + Sum(m + 1, n);
// }


// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.


    
    


