// // Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// Console.Write("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// int S =0;

// while (num > 0) {
// S += num % 10;
// num = (num - num % 10)/10;
// }

// Console.WriteLine ("Sum numbers of number is " + S );



// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// int [] numbers = new int[8];
// Console.Write("[");

// for (int i = 0; i < numbers.Length; i++)
//  {
//     numbers [i] = new Random().Next(0, 11);
//     Console.Write(" " + Method (i) + " ");
//  }
// Console.Write("]");
// int Method (int a)
// {
//     return numbers[a];
// }



// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// Console.Write ("Введите число А: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.Write ("Введите число B: ");
// int B = Convert.ToInt32(Console.ReadLine());
// {

//     for (int i = 1; i <= B; i++) ;

// }
// double result = 1;
// result = (Math.Pow (A , B));


// Console.WriteLine( $"{A} ^ {B} = {result}");
